*************************
*HRmis.prg &&(主控程序)
*************************
TRY
**********结构化错误处理程序****抛出异常*****20151110************
deac wind 'PROJECT MANAGER'
do setting
*****1.系统运行环境设置**********
on key label rightmouse do right.mpr
on key label F1 do grcx
do MAIN.mpr
*****2.系统运行菜单**********
DO sjcsh
*****3.系统初始化**********
clear window
*******先擦除当前窗口（此命令包括清除当前数据窗口----表单、数据环境，表单调程序时慎用此命令），确保系统杂志封面全屏拉伸显示*****20161122***********
DO FORM user
*****4.用户登录及使用权限分配**********
*******************根据系统设置用户类别分配版本类型而进行结构化错误处理********20151110********************************
READ EVENTS
*****5.读取事件运行系统*********20151110****
CATCH TO oException
   IF oException.ErrorNo = 1
      STRTOFILE("系统出错日志：错误发生在 " + TRANSFORM(DATETIME());
         + CHR(13),"Errors.log",.T.)
   ENDIF
ENDTRY
DO CASE
CASE 版本='测试版' &&高级用户
   on error do CCCL with error() , message() , message(1) , sys(16) , lineno()
   ****************1.默认出错陷井处理方式为调试状态，确保系统一启动在初始化中出错时能够捕捉到出错信息并提供用户快捷处理和恢复系统正常运行************20161229**************
   READ EVENTS&&读取事件运行系统，首次出错闪退、忽略待下次选择处理方式 
   ********法一：测试版本赋函数值传递出错信息提供程序员远程调试**********
CASE 版本='专业版' &&普通用户
   on error do form CCCL 
   READ EVENTS&&读取事件运行系统，首次出错闪退、忽略待下次选择处理方式 
   ********法二：正式发布试用版标准出错处理*******专业版容错处理：自我纠错选择出错处理方式************
CASE 版本='标准版' &&初级用户
    CLEAR EVENTS  &&  结束事件的读取
    **********2.正常运行后，再划分用户级别并体验相应的处理模式，不处理直接闪退系统**********20161229******************************
    quit
   ********法三：正式发布正式版本标准出错处理*******标准版容错处理：不闪退、无条件强行退出系统************
ENDCASE 
